# 通径分析
install.packages("agricolae")
library(agricolae)
x1 <- c(59, 63, 63, 64, 63, 61, 65, 62, 63, 57, 60, 60, 67, 68, 66, 60, 69, 
    58, 65, 69)
x2 <- c(71, 73, 73, 82, 74, 75, 74, 68, 74, 67, 71, 70, 77, 73, 77, 80, 76, 
    70, 83, 88)
y <- c(14, 15, 17, 21, 20, 18, 17, 17, 21, 14, 16, 14, 18, 17, 20, 19, 21, 
    14, 23, 24)
data <- data.frame(x1, x2, y)
cor.x <- cor(data[, 1:2])  #自变量的相关系数矩阵
cor.x <- as.matrix(cor.x)  #转换为矩阵
cor.y <- c(cor(x1, y), cor(x2, y))  #自变量与因变量的相关系数，列向量
cor.y <- as.matrix(cor.y)
path.analysis(cor.x, cor.y)  #输出结果，对角线表示自变量对y的直接作用，[1,1]表示q1，[2,2]表示q2
# [1,2]表示x1通过x2的间接作用，为r12与q2的成绩；
# [2,1]表示x2通过x1的间接作用，为r12与q1的成绩 
